Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/L02.tmx
Source language: en_us
Languages: zh_cn

source: chest open
zh_cn: 打开胸腔

source: On the grass with our heads together under a Port Jackson fig tree that is trying to fill the sky.
zh_cn: 我们躺在杰克逊港一棵无花果树的草地上，头靠着头，仰望着天际。

source: I slip the camera out of my pocket and take a photograph of the moment.
zh_cn: 我从我的口袋里掏出相机，记录下了这一刻。

source: Embarrassed smiles as naked we straighten the crumpled bed sheet.
zh_cn: 当赤裸的我们直接从被揉皱的床单上起来，都尴尬的笑了。

source: She leaves the room for the bathroom and while she is gone I feel around for the camera and take a photo of the bare bed.
zh_cn: 她离开卧室网卫生间走去，我到处寻找照相机，想要为这个光秃秃的床拍一张照。

source: She comes back in after the flash has lit the dark and frowns and I say sorry and shrug and put the camera away but want to take a photo of this moment too.
zh_cn: 闪光灯刚刚打开照亮黑暗的卧室她就皱着眉头进来了，我耸耸肩说对不起，然后把相机放在一边，但是我仍然想把现在这个场景记录下来。

source: It is early morning when the call comes.
zh_cn: 当那个电话打来的时候还是凌晨。

source: I hang up.
zh_cn: 我挂断了。

source: At first I do not remember but I remember and take a photo of me having hung up.
zh_cn: 一开始我并不记得，但是我记得我拍了一张照片记录了我挂断电话。

source: I get dressed and tell her I will come back soon and call her if it is not soon.
zh_cn: 我梳妆打扮了一下然后告诉她我很快就会回去，并告诉她，如果我不能很快回去，会打电话给她。

source: Sunlight makes the bright room glow almost neon.
zh_cn: 阳光使房间闪亮如霓虹。

source: I pull stray hair that isn't mine or that of anybody I know off my clothes.
zh_cn: 我从我的衣服上拍掉一些不属于我的或者说不属于任何我认识的人的头发。

source: Freed from heads and caught on the wind only to stick to me.
zh_cn: 头脑像得到了解放一样，只感受到风一直在吹拂着我。

source: I shake out my scarf and pick off a single short hair dark like mine dark like the hair on my head and on my body.
zh_cn: 我抖开我的围巾，拉下一小段黑色织物，黑的像我的头发和体毛一样。

source: I can only think of a chest open with ribs splintered.
zh_cn: 我唯一能想到的就是一个被打开的胸腔，里面是粉碎的肋骨。

source: Body.
zh_cn: 身体。

source: I give thought to this simple word body.
zh_cn: 我想到了这个简单的词。

source: Think what it means and think about my body in this hard plastic chair and his body and the bodies around his body trying to fix the body that he has partly left lungs open to the world.
zh_cn: 想想它到底意味着什么，想想我那坐在坚硬的塑料椅子里的身体，想想他的身体，想想那些围绕在他的身体周围，想要把他在空气中暴露一半的肺治好的身体。

source: The surgeon holds it in her hand.
zh_cn: 外科医生的手里举着肺叶。

source: Holds this piece in her hand still warm and carved off bloody chest open and puts it on a steel tray that reflects the light as white as hell.
zh_cn: 举着这片在她的手里仍然温暖，雕刻了血腥的肺叶放在钢制托盘，反射的光白如地狱。

source: Brain asleep chest open kept alive by the wires and the secret thoughts of machines.
zh_cn: 大脑沉睡了，胸腔被打开了，生命的延续依靠着连接机器的几根电线。

source: Chest open to the air and rib bones splintered under the electric saw.
zh_cn: 胸腔被打开，暴露在空气中，肋骨也被电锯一根根地切断。

source: Lung piece carved off like leg ham. Skin sluiced and pegged back to show inside.
zh_cn: 医生像切火腿一样切下肺叶，用水冲洗了皮肤，重新固定到原位，以便能够更清楚地看到身体内部的状况。

source: A finger quivers then knee caps twitch and a part of him that is being carried away for biopsy.
zh_cn: 他的手指微微抖动了一下，紧随着的就是膝盖的一次抽动。

source: Chest open with a radio on.
zh_cn: 他的肺的一部分已经被拿去做切片分析。

source: Her favourite channel because the hum helps the surgeon think as she operates.
zh_cn: 医生打开了广播，听着她最喜欢的节目，因为广播里的嗡鸣声可以帮助她在做手术的时候更好地思考。

source: Music and ads about sales and talkback help when there is a chest open before her like a meal.
zh_cn: 关于销售的广告和音乐以及广播里的内容进行反驳可以让她在面对像一盘大餐一样的打开的胸腔时集中注意力。

source: Alien light from somewhere else lighting the chest cavity.
zh_cn: 忽然从别处来的一束光照亮了胸腔。

source: Assistants breathing into their masks staunch bleeding and monitor the body with a chest open and time on watches while their coats become dappled with blood from the body of the man.
zh_cn: 医生的助手一边在面罩下喘气，一边给他止血，同时时刻监视着胸腔被打开的病人，他们的外套都已经染上了病人的血。

source: Their telling of weekend stories among the electronic beep of life and radio music because it is a job for them while this body is open.
zh_cn: 帮伴随着电子仪器的嘟嘟响和广播里播放的音乐，他们谈论着自己的周末生活，尽管病人的胸腔依旧打开着，但这也是他们生活的一部分。

source: Flecks of sweat glitter on my fingertips.
zh_cn: 我的手指上沾满了闪闪发光的汗珠。

source: There is pressure on my bladder and my feet are cold.
zh_cn: 我的膀胱感到难受，双脚冰凉。

source: An eyelash caught on the left breast of my shirt.
zh_cn: 一根眼睫毛掉在了我T恤的左胸上。

source: I brush it off and want a god that blows a distant wind to whisper a prayer to.
zh_cn: 我把它从我的T恤上抹掉，此时我希望一个天神能从远处吹来一阵风，如同一句为我祈祷的耳语。

source: I want a small god like a kitchen corner Hindu deity to reject and be mad at if I must be mad.
zh_cn: 我希望当我就要生气的时候，一个小仙，比如厨房角落里摆放的印度神像能够阻止我，并且对我的这种行为表示愤怒。

source: I hope I do not need to be mad.
zh_cn: 而我也希望我觉得没必要去感到愤怒。

source: Damp under the underarms.
zh_cn: 我的腋下湿透了。

source: Heart alive in my chest circulating blood.
zh_cn: 我的心脏依旧在进行着血液循环。

source: The sound of wind at the window.
zh_cn: 窗外传来阵阵风声。

source: Chest open.
zh_cn: 胸腔依旧打开着。

source: Oxygen is fed into the working lung while this man this unconscious body of a man remains in deepest sleep.
zh_cn: 氧气被输送进依旧工作着的肺中，这个依旧毫无意识的人仍然沉睡着。

source: I feel the rush of impulse.
zh_cn: 我突然觉得自己有一种冲动。

source: I dry my hands on my jeans and tug my thoughts back from the room and slip the camera out of its cover and take a photo of this moment.
zh_cn: 我把我满是汗水的手在我的牛仔裤上擦干，我把我的思绪从那个房间里收回来，拿掉相机盖，拍一张此时此刻情景的照片。

source: I think of taking a photo of the moment in which I take a photo of the moment.
zh_cn: 我也想把我此时想拍一张照片的情景给拍下来。

source: I scroll through the other photos I have taken to take my mind off what I am thinking and think about taking a photo of me scrolling through the moments I have taken photos of.
zh_cn: 我把思绪从我正在想的事情中抽出来，看了看我拍的照片，突然我又想把我拍照的这个场景给拍下来。

source: A nurse calls my name and I follow her to an office where she stands beside a cluttered desk and tells me news that is not good and asks me if I have other family I need to tell and if she can help do that.
zh_cn: 一位护士叫了我的名字，然后我跟着她进了办公室。她站在一个零乱的书桌旁边告诉我情况不太乐观，并问我是否有其他加人需要告知，她可以帮助我。

source: I nod and say that will be nice and I slip the camera out of its case.
zh_cn: 我点点头说这样很好，然后我从盒子中取出相机。

source: I walk by the highway past car lots with flags fluttering and words in fluoro paint painted across the windshields of the cars to my home a long way from here but I am walking.
zh_cn: 我走在高速公路上，许多开过的车子上插着飘扬的旗帜，车子的挡风玻璃上用氟涂着字。到我家还有一段很长的路但我仍然要走回去。

source: We crowd around the coffee table.
zh_cn: 我们围坐在咖啡桌前。

source: I am watched from eye corners while they pour drinks and spill alcohol wetting the tablecloth.
zh_cn: 他们一边倒酒，一边用眼角的余光瞟着我，把酒洒在了桌布上。

source: I smell sweet dope and one of my friends smokes with another friend on the balcony.
zh_cn: 我闻到一股甜甜的味道和我的两个朋友在阳台上吸烟的味道。

source: They talk for my benefit and I join in where I can.
zh_cn: 他们是为我好，我要是可以吸的就会加入他们。

source: They are here for me and I want to tell them it is not needed and to go away home.
zh_cn: 他们是来陪我的，我告诉他们没必要这么做，他们可以回各自的家了。

source: One of them proposes a toast and I put my hand over my eyes while we touch glasses. I take a photograph of us friends here in the starkness of my living room.
zh_cn: 他们其中的一个人向我举杯，我在和他碰杯的时候把我的手举到自己的眼睛上方，我为我待在我那没有多少东西的客厅里的朋友们拍了张照。

source: After glasses have been emptied I say to them I am leaving for a while going away and they go quiet and I take a photo of the glasses and bottles of grog on the table.
zh_cn: 杯子里的酒喝完后我告诉他们我想要离开一小会儿，他们沉默了，我于是拍了一张桌子上的玻璃杯和格罗格酒酒瓶的照片。

source: Late night a friend pulls me out of the flat and down the stairs and we talk under a street light.
zh_cn: 深夜一个朋友拉着我走出公寓，下了楼，我们便在路灯下聊起了天。

source: I have my hands in my pockets and he talks in my face.
zh_cn: 我把手插在口袋里，他和我面对面说话。

source: I nod but have left the camera upstairs so I tell my friend to wait and that I will come back but he says forget it.
zh_cn: 我点点头，但是我的相机忘在了楼上，所以我告诉他在那儿等着，我很快就回来，但是他说，忘了它吧。

source: When the others have left we sit in silence while the television plays.
zh_cn: 当其他人都走了，我们两个开着电视机默默地坐着。

source: Finally she says she may not be here when I come back if I do this and we both let this breathe for a moment.
zh_cn: 最后，她说，要是我回来以后仍然是这样，她就再也不会待在这儿了。

source: I ask her what she wants me to do then.
zh_cn: 然后我问她想要我做什么。

source: Hurt she says she thought I was different to this.
zh_cn: 她痛苦地说我对这漠不关心。

source: I sniff and clear my nose and touch the area of my chest where I imagine my lungs to be.
zh_cn: 我吸了一口气，清了清我的鼻子，摸到我的胸口上我认为是我的肺部的位置。

source: Then I take the camera out of its pouch and take a photo of this.
zh_cn: 然后我从相机袋里拿出相机，对着那儿拍了一张照。

source: She says to me what the fuck are you doing put it away so I get up and pull the suitcase off the top of the cupboard and open it up on the floor.
zh_cn: 她对我说你他妈的到底在干嘛，赶紧把它放好。所以我起身从碗橱顶上把手提箱拿下来放到地板上，我把箱子打开，把相机往里面装。

source: Halfway through packing I take a photo.
zh_cn: 在我装到一半的时候，我又顺手拍了一张照片。

source: In the morning I lean my backpack against my suitcase in the hallway.
zh_cn: 早上在走廊里，我把我的背包靠在手提箱上。

source: She calls me a coward she says this is a cowardly act.
zh_cn: 她说我是个胆小鬼，我的所作所为显得我是个懦夫。

source: She watches as I take a photo of me being cowardly.
zh_cn: 当我把我胆小的样子拍下来的时候她就这么盯着我看。

source: She says I think I am justified now in taking these bullshit little pictures.
zh_cn: 她说我拍下这些破照片时肯定觉得自己心安理得。

source: I say yes probably now I suppose.
zh_cn: 我说对，可能我确实就是这么想的。

source: I sit at a sooty table on the roof of a Saigon hotel with sweat rolling down my calves.
zh_cn: 我坐在西贡旅馆屋顶的一张黑黑的桌子边，汗水顺着我的小腿流了下来。

source: The only other people up here are a smiling Chinese couple in blazers and matching sunglasses and a bartender polishing glasses.
zh_cn: 在这儿唯一的人就是一对穿着轻便运动上衣，带着合适的太阳镜，面带笑容的中国夫妇以及一个正在擦杯子的酒保。

source: I sip at a perspiring gin and tonic with a wedge of lime that the bartender squeezed over then dropped into the drink.
zh_cn: 酒保把一只柠檬挤压后放进一杯冒着水汽的杜松子奎宁酒中，我细细地抿着它们。

source: While I cannot see them I can hear the swarms of scooters twenty floors down.
zh_cn: 尽管我看不见二十层楼下的一大群小摩托车，但是我仍能听见它们的声音。

source: The sounds of their horns rise up like the wailing of damned. Somewhere up here is a pool.
zh_cn: 它们的喇叭声如同地狱里的哀号，离这儿高一点的地方是一个游泳池。

source: I am aware of the splash of a stroke a kick or the crackle of water hitting pavement as a swimmer climbs out to dry off.
zh_cn: 我能听到在水池里游泳的人爬出来晾干身体时把水溅到人行过道上的声音。

source: The wind whips in every direction and most of the other buildings are squat and out of sight so it seems like I am on the rooftop of a skyscraper in hell.
zh_cn: 风从四面八风吹过，其他大部分建筑都比较矮，坐落在远处的我也看不见，我感觉我如同身处一座直插云霄的摩天大楼的顶端。

source: What Saigon calls to mind I have not found here.
zh_cn: 西贡旅馆能让我联想到的东西我在这儿还没有发现。

source: Saigon Saigon.
zh_cn: 西贡西贡。

source: Ho Chi Minh they call it now as if it were the man with the beard of wisps.
zh_cn: 现在他们把它叫做胡志明市，如同它就是那个给他们带来大捆面包的人。

source: Maybe that is why I have not found smoky bars with lanterns or Vietnamese women in traditional dress and make up maybe that is somewhere else. Maybe it is Hollywood.
zh_cn: 也许这就是我在这儿没有发现挂着灯笼的乌烟瘴气的酒吧和穿着传统服装有着传统打扮的越南女人的原因。也许它是另一个地方，也许它是好莱坞。

source: The sky is a pure grey wall of dull aluminium light that does not look like ever parting for the sun that I can barely open my eyes against.
zh_cn: 天空如同一堵反射着暗淡的铝片光泽的灰色的墙，完全看不到那让我无法用眼睛直视的太阳的光辉。

source: I make a mental note to buy sunglasses off a walking street vendor.
zh_cn: 我决定到沿街叫卖的小贩那儿买一副太阳镜。

source: I breathe hot air deep into my chest.
zh_cn: 我深深地吸进一口热空气。

source: Neon lights burning through the dark and paper parasols.
zh_cn: 霓虹灯光照进了黑暗，透过了纸阳伞。

source: I tinkle the ice now small slivers the shape of tiny canoes in my drink.
zh_cn: 我敲了敲我饮料里的冰块，现在它们都已经融化成了一条条小小的银色小舟。

source: Singapore Slings I think and think that maybe I am confusing Saigon with Singapore. If so I have been wrong this entire time but I am here.
zh_cn: 我喝的饮料是新加坡先令，我觉得我不是在西贡而是在新加坡，如果真的是这样的话，我就整个全错了，但是我还是在西贡。

source: I wonder why the fuck I have come and remember to take a photo I take a photo.
zh_cn: 啊，我想知道我他妈的为什么到这个地方来，我想起来我应该拍一张照片，于是我就拍了一张。

source: The Chinese couple sit only a few tables away. If I spoke they would hear.
zh_cn: 那对中国夫妇坐在离我只隔着几张桌子的地方，要是我说出来的话他们肯定会听到的。

source: A blast of air blows across the hotel rooftop and rattles the umbrellas and attempts to uproot the decorative plants.
zh_cn: 一阵风吹过旅馆屋顶，把插着的伞弄得咯咯直响，那些景观植物也似乎要被风连根拔起。

source: I finish my drink and take a photograph and turn back to the bartender in black tie and vest to indicate that I want another.
zh_cn: 我喝完了我的饮料，转过身来对着打着黑色领带，穿着背心的酒保示意我还想要一杯。

source: I imagine him cupping the lime and squeezing the juice into my drink before placing it in with something like love.
zh_cn: 我想象着他把柠檬压扁，把像爱一样的东西和柠檬汁倒进我的饮料。

source: I know now I like to be driven past things to get a glimpse between palm trees.
zh_cn: 现在我知道我喜欢被领着在棕榈树丛里瞥一眼周围的东西。

source: Peering out of a taxi window feels more right than being in somewhere significant and led around by a guide who is unaffected by the heat and more right than knowing it in this way.
zh_cn: 从计程车窗向外瞄一眼比被完全不怕热的导游领着在名胜古迹里游览感觉要好得多。

source: A glimpse that impresses a single frame of it into my memory even before I can get my camera ready.
zh_cn: 在我还没来得及准备好我的相机之前瞥一眼，我就能把东西的轮廓记在心间。

source: The Chinese woman has put her sunglasses on her head and is touching up her lipstick.
zh_cn: 中国夫妇里的妻子把她的太阳镜推到自己的头上，涂着口红。

source: I see her eye looking at me in her mirror.
zh_cn: 我看到她在镜子里看着我。

source: I squeeze the camera out of its case but before I can take a photograph the bartender arrives and replaces my empty glass with a full one.
zh_cn: 我把相机从盒子里拽出来，然而在我正准备拍照片之前，酒保走过来为我的空杯子又倒上了饮料。

source: I tell him to charge it to my room squinting into the horizon.
zh_cn: 我看着斜对面的地平线，告诉他把饮料钱记在我的房间费用上。

source: The bartender presents a receipt for me to sign.
zh_cn: 酒保拿出一张收据让我在上面签字。

source: I tell him up here it feels like I am drinking gin and tonics on Mars and look towards him but not at him and when he has no reaction I wonder if this was not a polite joke.
zh_cn: 我告诉他在这儿我感觉自己像是在火星上喝杜松子奎宁酒，我看着他但也不是眼睛直勾勾地看着他，当我发现他对此毫无反应时，我觉得我开的这个玩笑有点不礼貌。

source: He leaves me to the locust buzz of bikes in the wind the horns like safari birds while sweat runs down to the small of my back.
zh_cn: 他把我丢在那儿，听着自行车发出的类似蚱蜢鸣叫的嗡嗡声，风中，喇叭声如同狩猎鸟儿时的号角声，我也已经汗流浃背了。
